Autodesk.Revit.DB.Architecture.HandRailType.SupportJustification
The support justification method of the handrail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The rail has no support or the support layout is not fixed distance so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.HandRailType.SupportLayout
The support layout method of the handrail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The rail has no support specified so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.HandRailType.SupportNumber
The number of supports of the handrail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for supportNumber is negative.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The rail has no support or the support layout is not fixed number so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.HandRailType.SupportTypeId
The support type of the handrail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The supportTypeId is not a valid rail support or invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.HandRailType.SupportSpacing
The support spacing of the handrail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for supportSpacing must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The rail has no support or the support has inappropriate layout so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.HandRailType.Height
The height of the handrail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for height must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.HandRailType
A rail type object that is used in the generation of hand rail.
Since:
2013